{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Computer Software \u0026 Database Management",
      "department": "Computer Engineering",
      "duration": "2020-2021",
      "school_name": "Lambton College"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_OzgucDalga",
  "highlighted_projects": [
    {
      "description": "Designed an application using Visual Studio code editor. The application utilizes javascript codes along with the ReactJs framework and updates the database(MongoDB) with pre-defined SQL queries. Application is built and compiled using NPM package manager and organized with MVC architecture implementing ReactJS advanced hooks. The source code is published on Github.",
      "git_url": "https://github.com/ozgucdlg/mernStackHistoryAgenda",
      "name": "Web app for History Agenda"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed an application in Linux centos7. The application collects hardware data and monitors them by using a bash Script. The data is stored in the Postgresql instance deployed in docker. Throughout testing, the application is tested by using simplified pre-defined SQL queries. The application is scheduled using crontab.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_OzgucDalga/tree/main/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Designed an application that executes JDBC API to connect between Java program and PostgreSQL database instance deployed using Docker. CRUD operations are applied based on JDBC connection with pre-defined SQL queries. The outputs are monitored on the DbeaverUI program.",
        "Grep App: Developed an application that recreates a basic Linux grep command. The application is built using Maven. Performed Lambda functions and Stream Api to reduce memory usage and to catch an optimum performance. The application is also deployed on the Docker hub."
      ],
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_OzgucDalga/tree/main/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Ozguc Dalga",
  "others": [
    {
      "bullets": [
        "Triathlon: Keeping on my training as a junior ironman.",
        "Basketball: Having regular activity on weekends as an amateur player."
      ],
      "title": "Miscellaneous"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting Group",
      "description": "Worked on the Jarvis-training program as a full-stack developer. My main responsibilities are: Designing and developing APIs using JAVA. Developing backend websites application through SprinBoot java. Designing database functionalities using PostgreSQL. Managing the requirement of agile methodologies such as Scrum meetings. Designing the containerization requirements for current applications in Docker. Handling version updates control, Git, Github, and Gitflow.",
      "duration": "2022-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Maven",
      "Docker",
      "JavaScript",
      "JUnit",
      "MySql"
    ],
    "familiar": [
      "Hadoop",
      "Spark/Scala",
      "Springboot",
      "Python",
      "MongoDB"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I graduated from Lambton College with a degree in Computer Software \u0026 Database Management, and am now a full Stack developer at Jarvis Consulting Group, where I work in an Agile environment. I have experience with Java, Maven, JUnit, MySQL, PostgreSQL, bash, and docker. I have used Postman for developing RESTful apps. I consider myself a positive person, a cross-functional team member, a quick learner, detail-oriented, and adaptable to changing circumstances. I always make sure that I meet deadlines. Throughout my career, I have had a strong passion for math and am interested in searching for new technologies and implementing them in-depth."
}
